Repository: planetary-social/nos
Catalog: Nos/Assets/Localization/ImagePicker.xcstrings
Source language: en
Languages: ar, de, es, fa, fr, ja, ko, nl, pt_br, sv, sw, th, tr, zh_hans, zh_hant

source: Camera
ar: الكاميرا
de: Kamera
es: Cámara
fa: دوربین
fr: Appareil photo
ja: カメラ
ko: 카메라
pt_br: Câmera
sv: Kamera
sw: Kamera
th: กล้อง
tr: Kamera
zh_hans: 摄像机
zh_hant: 攝像機

# cameraNotAvailable
source: Camera is not available on this device
ar: الكاميرا غير متوفرة على هذا الجهاز
de: Kamera ist auf diesem Gerät nicht verfügbar
es: La cámara no está disponible en este dispositivo
fa: دوربین در این دستگاه موجود نیست
fr: L'appareil photo n'est pas disponible sur cet appareil
ja: このデバイスではカメラは利用できません
ko: 이 디바이스에서 카메라 사용 불가
nl: Camera is niet beschikbaar op dit apparaat
pt_br: A Câmera não está disponível neste dispositivo
sv: Kameran är inte tillgänglig på denna enhet
sw: Kamera haipatikani kwenye kifaa hiki
th: กล้องไม่พร้อมใช้งานบนอุปกรณ์นี้
tr: Kamera bu cihazda kullanılamıyor
zh_hans: 摄像机在此设备上不可用
zh_hant: 攝像機在此設備上不可用

# errorUploadingFile
source: Error uploading the file
ar: خطأ في تحميل الملف
de: Fehler beim Hochladen der Datei
es: Error subiendo el archivo
fa: خطا در بارگذاری فایل
fr: Erreur lors de l'envoi du fichier
ja: ファイルのアップロード中にエラーが発生しました
ko: 파일을 업로드하는 도중 오류가 발생했어요
nl: Fout bij uploaden van bestand
pt_br: Erro ao enviar o arquivo
sv: Fel vid uppladdning av filen
sw: Hitilafu katika kupakia faili
th: เกิดข้อผิดพลาดในการอัปโหลดไฟล์
tr: Dosya yüklenirken hata oluştu
zh_hans: 上传文件出错
zh_hant: 上傳文件出錯

# errorUploadingFileExceedsLimit
source: The max file size for free media uploads is %@. To upload large files, upgrade to a Nostr.build Professional account.
ar: الحد الأقصى لحجم الملف للتحميلات المجانية هو %@. لتحميل ملفات كبيرة، قم بالترقية إلى حساب Nostr.build الاحترافي.
de: Die maximale Dateigröße für kostenlose Uploads beträgt %@. Um größere Dateien hochzuladen, upgrade auf ein Nostr.build Professional-Konto.
es: El maximo tamaño para publicacion de achivos gratis es %@. Para subir archives mas grande puedes pagar para subscribir a una cuenta Nostr.build pro.
fa: حداکثر حجم فایل برای بارگذاری رایگان رسانه %@ است. برای بارگذاری فایل های بزرگتر، به حساب حرفه ای Nostr.build ارتقاء دهید.
fr: La taille maximale des fichiers pour les téléchargements de médias gratuits est %@. Pour télécharger des fichiers plus volumineux, passez à un compte Nostr.build Professional.
ja: 無料メディアアップロードの最大ファイルサイズは%@です。より大きなファイルをアップロードするには、Nostr.buildプロフェッショナルアカウントにアップグレードしてください。
nl: De maximale bestandsgrootte voor gratis media-uploads is %@. Om grotere bestanden te uploaden, upgrade naar een Nostr.build Professional account.
pt_br: O tamanho de arquivo máximo para o “upload” grátis é %@. Para fazer o "upload" de arquivos grandes, atualize para uma conta "Nostr.build Professional".
sv: Maximal filstorlek för gratis mediauppladdningar är %@. För att ladda upp stora filer, uppgradera till ett Nostr.build Professional-konto.
sw: Ukubwa wa juu wa faili kwa upakiaji wa media wa bure ni %@. Ili kupakia faili kubwa, panda daraja hadi akaunti ya Nostr.build Professional.
th: ขนาดไฟล์สูงสุดสำหรับการอัปโหลดสื่อฟรีคือ %@ หากต้องการอัปโหลดไฟล์ขนาดใหญ่ โปรดอัปเกรดเป็นบัญชี Nostr.build Professional
tr: Ücretsiz medya yüklemeleri için maksimum dosya boyutu %@. Büyük dosyaları yüklemek için Nostr.build Professional hesabına yükseltin.
zh_hans: 免费媒体上传的最大文件大小为 %@。要上传大文件，请升级到 Nostr.build 专业版帐户。
zh_hant: 免費媒體上傳的最大檔案大小為 %@。要上傳大檔案，請升級到 Nostr.build 專業版帳戶。

# errorUploadingFileExceedsSizeLimit
source: Get a Nostr.build account to upload larger files
ar: احصل على حساب Nostr.build لتحميل ملفات أكبر
de: Hol dir ein Nostr.build-Konto um größere Dateien hochzuladen
es: Registarse para una cuenta pro de Nostr.build para la abilidad de subir archivos mas grande
fa: یک حساب Nostr.build برای بارگذاری فایل های بزرگتر بگیرید
fr: Obtenez un compte Nostr.build pour télécharger des fichiers plus volumineux
ja: より大きなファイルをアップロードするにはNostr.buildアカウントを取得してください
ko: Nostr.build 계정을 통해 더 큰 파일을 업로드하세요
nl: Krijg een Nostr.build account om grotere bestanden te uploaden
pt_br: Obtenha uma conta 'Nostr.build' para fazer 'upload' de arquivos maiores
sw: Pata akaunti ya Nostr.build ili kupakia faili kubwa zaidi
th: รับบัญชี Nostr.build เพื่ออัปโหลดไฟล์ขนาดใหญ่
tr: Daha büyük dosyalar yüklemek için bir Nostr.build hesabı edinin
zh_hans: 获取 Nostr.build 帐户以上传更大的文件
zh_hant: 獲取 Nostr.build 帳戶以上傳更大的檔案

# errorUploadingFileMessage
source: An error was encountered when uploading the file you provided. Please try again.
ar: حدث خطأ عند تحميل الملف الذي قدمته. يرجى المحاولة مرة أخرى.
de: Beim Hochladen der Datei ist ein Fehler aufgetreten. Bitte versuche es erneut.
es: Hubo un error en el intento de subir archivos. Porfavor intenta de vuelta.
fa: هنگام بارگذاری فایلی که دادید خطایی رخ داد. لطفا دوباره تلاش کنید.
fr: Une erreur s'est produite lors du téléchargement du fichier que vous avez fourni. Veuillez réessayer.
ja: 提供されたファイルのアップロード中にエラーが発生しました。もう一度お試しください。
ko: 파일을 업로드하는 동안 오류가 발생했습니다. 다시 시도하세요.
nl: Er is een fout opgetreden bij het uploaden van het bestand dat je hebt aangeleverd. Probeer het opnieuw.
pt_br: Foi encontrado um erro ao carregar o arquivo que você forneceu. Por favor, tente novamente.
sv: Ett fel uppstod vid uppladdning av filen du angav. Försök igen.
sw: Hitilafu ilitokea wakati wa kupakia faili uliyotoa. Tafadhali jaribu tena.
th: เกิดข้อผิดพลาดเมื่ออัปโหลดไฟล์ที่คุณให้มา โปรดลองอีกครั้ง
tr: Sağladığınız dosya yüklenirken bir hata oluştu. Lütfen tekrar deneyin.
zh_hans: 上传你提供的文件时发生错误。请重试。
zh_hant: 上傳你提供的文件時發生錯誤。請重試。

# errorUploadingFileWithMessage
source: An error was encountered when uploading the file you provided. The message was: "%@"
ar: حدث خطأ عند تحميل الملف الذي قدمته. الرسالة هي: "%@"
de: Beim Hochladen der Datei ist ein Fehler aufgetreten. Die Fehlermeldung lautet: "%@"
es: Hubo un error en el intento de subir el archivo. El mensaje de error era"%@"
fa: هنگام بارگذاری فایلی که دادید خطایی رخ داد. پیغام خطا: "%@"
fr: Une erreur s'est produite lors du téléchargement du fichier que vous avez fourni. Le message était : "%@"
ja: 提供されたファイルのアップロード中にエラーが発生しました。メッセージ："%@"
ko: 파일을 업로드하는 동안 오류가 발생했습니다. 메세지: "%@"
nl: Er is een fout opgetreden bij het uploaden van het bestand dat je hebt aangeleverd. Het bericht was: "%@"
pt_br: Foi encontrado um erro ao carregar o arquivo que você forneceu. A mensagem foi: "%@"
sv: Ett fel uppstod vid uppladdning av filen du angav. Meddelandet var: "%@"
sw: Hitilafu ilitokea wakati wa kupakia faili uliyotoa. Ujumbe ulikuwa: "%@"
th: เกิดข้อผิดพลาดเมื่ออัปโหลดไฟล์ที่คุณให้มา ข้อความคือ: "%@"
tr: Sağladığınız dosya yüklenirken bir hata oluştu. Mesaj şuydu: "%@"
zh_hans: 上传您提供的文件时遇到错误。消息为："%@"
zh_hant: 上傳您提供的檔案時遇到錯誤。訊息為："%@"

source: Get Account
ar: الحصول على حساب
de: Konto erstellen
es: Registar una Cuenta
fa: ایجاد حساب
fr: Obtenir un compte
ja: アカウントを取得
ko: 계정 생성
nl: Account aanmaken
pt_br: Obter uma conta
sw: Pata Akaunti
th: รับบัญชี
tr: Hesap Oluştur
zh_hans: 获取帐户
zh_hant: 獲取帳戶

# openSettingsMessage
source: You can allow camera permissions by opening the Settings app.
ar: يمكنك السماح بأذونات الكاميرا من خلال فتح تطبيق الإعدادات.
de: Du kannst die Kamera-Berechtigungen zulassen, indem du die Einstellungen-App öffnest.
es: Puedes dar permiso a aceder la cámara en el app de configuraciones.
fa: می توانید مجوز دوربین را در تنظیمات اپ مجاز کنید.
fr: Vous pouvez autoriser l'accès à l'appareil photo en ouvrant l'application Paramètres.
ja: 設定アプリを開いてカメラの権限を許可することができます。
ko: 설정을 통해 카메라 권한을 허용할 수 있습니다.
nl: Je kunt cameratoegang toestaan door de Instellingen-app te openen.
pt_br: Você pode habilitar as permissões da câmera abrindo as Configurações do aplicativo.
sv: Du kan tillåta kamerabehörigheter genom att öppna appen Inställningar.
sw: Unaweza kuruhusu vibali vya kamera kwa kufungua programu ya Mipangilio.
th: คุณสามารถอนุญาตให้ใช้กล้องได้โดยเปิดแอพการตั้งค่า
tr: Ayarlar uygulamasını açarak kamera izinlerine izin verebilirsiniz.
zh_hans: 您可以通过打开设置应用程序允许摄像机权限。
zh_hant: 您可以通過打開設置應用程式允許攝像機權限。

# permissionsRequired
source: Permissions required for %@
ar: الأذونات مطلوبة لـ %@
de: Berechtigungen werden für %@ benötigt
es: Prescisa permiso para %@
fa: برای %@ به مجوز نیاز است
fr: Autorisations requises pour %@
ja: %@に必要な権限
ko: %@를 위해 권한이 필요합니다
nl: Toestemmingen vereist voor %@
pt_br: Permissões necessárias para %@
sv: Behörigheter krävs för %@
sw: Vibali vinahitajika kwa %@
th: ต้องการสิทธิ์สำหรับ %@
tr: %@ için izinler gerekli
zh_hans: %@ 所需的权限
zh_hant: %@ 所需的權限

source: Photo Library
ar: مكتبة الصور
de: Fotogalerie
es: Bibiloteca de Fotos
fa: گالری عکس
fr: Photothèque
ja: フォトライブラリ
ko: 갤러리
nl: Fotobibliotheek
pt_br: Biblioteca de Fotos
sv: Bildbibliotek
sw: Maktaba ya Picha
th: คลังรูปภาพ
tr: Fotoğraf Kütüphanesi
zh_hans: 相册
zh_hant: 相冊

# selectFrom
source: Select from Photo Library
ar: اختر من مكتبة الصور
de: Aus Fotogalerie wählen
es: Elijir fotos en la biblioteca
fa: انتخاب از گالری عکس
fr: Sélectionner depuis la photothèque
ja: フォトライブラリから選択
ko: 사진 라이브러리에서 선택하기
nl: Selecteer uit fotobibliotheek
pt_br: Selecione a partir da Biblioteca de Fotos
sv: Välj från bildbibliotek
sw: Chagua kutoka Maktaba ya Picha
th: เลือกจากคลังรูปภาพ
tr: Fotoğraf Kütüphanesinden Seç
zh_hans: 从相册选择
zh_hant: 從相冊選擇

source: Take photo
ar: التقاط صورة
de: Foto aufnehmen
es: Tomar una foto
fa: عکس گرفتن
fr: Prendre une photo
ja: 写真を撮る
ko: 사진 찍기
nl: Foto maken
pt_br: Tirar foto
sv: Ta foto
sw: Piga picha
th: ถ่ายภาพ
tr: Fotoğraf çek
zh_hans: 拍摄
zh_hant: 拍照

source: Take photo or video
ar: التقاط صورة أو فيديو
de: Foto mit Kamera aufnehmen
es: Sacar un foto o video
fa: با دوربین عکس بگیرید
fr: Prendre une photo ou une vidéo
ja: 写真または動画を撮る
ko: 사진 혹은 영상 찍기
nl: Foto of video maken
pt_br: Tirar foto ou vídeo
sv: Ta ett foto med kameran
sw: Piga picha au video
th: ถ่ายภาพหรือวิดีโอ
tr: Fotoğraf veya video çek
zh_hans: 拍摄照片或视频
zh_hant: 拍攝照片或影片

source: Uploading...
ar: جاري التحميل...
de: Wird hochgeladen...
es: Subiendo...
fa: در حال بارگذاری...
fr: Téléchargement...
ja: アップロード中...
ko: 업로드 중...
nl: Uploaden...
pt_br: Enviando...
sv: Laddar upp...
sw: Inapakia...
th: กำลังอัปโหลด...
tr: Yükleniyor...
zh_hans: 上传中…
zh_hant: 上傳中…
